Documents/ЗароботнаяПлата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ЗароботнаяПлата</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоВычетаНДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Премия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗароботнаяПлата/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТабличнаяЧасть1ФИОПриИзменении(Элемент)
ТекДанные=Элементы.ТабличнаяЧасть1.ТекущиеДанные;
ТекДанные.Оклад=СотрудникиОкладСотрудникаПриИзмененииНаСервере(ТекДанные.ФИО); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция СотрудникиОкладСотрудникаПриИзмененииНаСервере(ФИО)
Возврат ФИО.ОкладСотрудника;
КонецФункции


&НаКлиенте
Процедура ТабличнаяЧасть1ДоВычетаНДФЛПриИзменении(Элемент)
ТекДанные = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
ТекДанные.ДоВычетаНДФЛ = ТекДанные.Оклад+ТекДанные.Премия

КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1ОкладПриИзменении(Элемент)
	ТекДанные = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	ТекДанные.ДоВычетаНДФЛ = ТекДанные.Оклад+ТекДанные.Премия
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1ПремияПриИзменении(Элемент)
	ТекДанные = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	ТекДанные.ДоВычетаНДФЛ = ТекДанные.Оклад+ТекДанные.Премия
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1ЗППриИзменении(Элемент)
	ТекДанные = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	ТекДанные.ЗП = ТекДанные.ДоВычетаНДФЛ - ТекДанные.ДоВычетаНДФЛ * ТекДанные.НДФЛ/100
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1ПриИзменении(Элемент)
	ТекДанные = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	ТекДанные.ЗП = ТекДанные.ДоВычетаНДФЛ - ТекДанные.ДоВычетаНДФЛ * ТекДанные.НДФЛ/100
КонецПроцедуры
